In [1]:
import sqlite3
import pandas

In [2]:
sqlite_file = 'lahman2014.sqlite'
conn = sqlite3.connect(sqlite_file)

In [3]:
salary_query = "SELECT yearID, sum(salary) as total_payroll FROM Salaries WHERE lgID == 'AL' GROUP BY yearID"

In [4]:
team_salaries = pandas.read_sql(salary_query, conn)
team_salaries.head()

   yearID  total_payroll
0    1985    134401120.0
1    1986    157716444.0
2    1987    136088747.0
3    1988    157049812.0
4    1989    188771688.0

## Part 1: Wrangling
### Problem 1